Ran Plan for 5 projects:

1. project: `marketplace-sqs-prod` dir: `terraform/environments/prod/sqs` workspace: `default`
1. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
1. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
---

### 1. project: `marketplace-sqs-prod` dir: `terraform/environments/prod/sqs` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.outbound_sync_dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "outbound_sync_dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in outbound sync DLQ"
      + alarm_name                            = "marketplace-outbound-sync-dlq-prod"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "prod-marketplace-outbound-sync-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                              = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_policy.sqs_access will be updated in-place
~ resource "aws_iam_policy" "sqs_access" {
        id               = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"
        name             = "marketplace-sqs-access-prod"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:GetQueueUrl",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-scoring",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-scoring-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-enhancement",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-enhancement-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-verification",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:prod-marketplace-inspection-verification-dlq",
                        ]
                      - Sid      = "SQSAccess"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:ap-northeast-2:646886795421:key/91c89963-2f1d-4a5b-8229-09cf52d6cf56",
                        ]
                      - Sid      = "KMSDecrypt"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "cost_center"  = "engineering"
            "data_class"   = "internal"
            "environment"  = "prod"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "marketplace"
            "service_name" = "marketplace-sqs"
            "team"         = "platform-team"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.outbound_sync will be created
+ resource "aws_sqs_queue" "outbound_sync" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/91c89963-2f1d-4a5b-8229-09cf52d6cf56"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "prod-marketplace-outbound-sync"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "prod-marketplace-outbound-sync"
          + "Purpose"      = "Outbound sync message relay to external channels"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-marketplace-outbound-sync"
          + "Project"      = "marketplace"
          + "Purpose"      = "Outbound sync message relay to external channels"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.outbound_sync_dlq will be created
+ resource "aws_sqs_queue" "outbound_sync_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/91c89963-2f1d-4a5b-8229-09cf52d6cf56"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "prod-marketplace-outbound-sync-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "prod-marketplace-outbound-sync-dlq"
          + "Purpose"      = "Dead letter queue for outbound sync"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Name"         = "prod-marketplace-outbound-sync-dlq"
          + "Project"      = "marketplace"
          + "Purpose"      = "Dead letter queue for outbound sync"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_ssm_parameter.inspection_enhancement_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-enhancement-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_enhancement_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-enhancement-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_enhancement_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-enhancement-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_scoring_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-scoring-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_scoring_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-scoring-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_scoring_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-scoring-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_verification_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-verification-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_verification_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-verification-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_verification_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/inspection-verification-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_dlq_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/outbound-sync-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_arn will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/outbound-sync-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/outbound-sync-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_access_policy_arn will be created
+ resource "aws_ssm_parameter" "sqs_access_policy_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/access-policy-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 16 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ outbound_sync_queue_arn           = (known after apply)
+ outbound_sync_queue_url           = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-prod
  ```
Plan: 16 to add, 1 to change, 0 to destroy.

---
### 2. project: `marketplace-ecs-web-api-stage` dir: `terraform/environments/stage/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-api-stage"
        name                               = "marketplace-api-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:193" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:193" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-api-stage" -> (known after apply)
      ~ revision                 = 193 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-api-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-api-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-web-api"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-api-stage:193" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-web-api-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-web-api-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 3. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-scheduler-stage"
        name                               = "marketplace-scheduler-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:199" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:199" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-scheduler-stage" -> (known after apply)
      ~ revision                 = 199 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-scheduler-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-scheduler-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-scheduler"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn   = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-scheduler-stage:199" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-scheduler-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-scheduler-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 4. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #18. To continue, delete the lock from #18 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 5. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-worker-stage"
        name                               = "marketplace-worker-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:142" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:142" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "marketplace-worker-stage" -> (known after apply)
      ~ revision                 = 142 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:142" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### Plan Summary

5 projects, 4 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```